OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1704.h
#define _G1BLKF0                0x01
#define _G1BLKF1                0x02
#define _G1BLKF2                0x04
#define _G1BLKF3                0x08
#define _G1BLKF4                0x10
#define _G1BLKF5                0x20

//==============================================================================


//==============================================================================
//        COG1DBR Bits

extern __at(0x0695) __sfr COG1DBR;

typedef union
  {
  struct
    {
    unsigned G1DBR0             : 1;
    unsigned G1DBR1             : 1;
    unsigned G1DBR2             : 1;
    unsigned G1DBR3             : 1;
    unsigned G1DBR4             : 1;
    unsigned G1DBR5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G1DBR              : 6;
    unsigned                    : 2;
    };
  } __COG1DBRbits_t;

extern __at(0x0695) volatile __COG1DBRbits_t COG1DBRbits;

#define _G1DBR0                 0x01
#define _G1DBR1                 0x02
#define _G1DBR2                 0x04
#define _G1DBR3                 0x08
#define _G1DBR4                 0x10
#define _G1DBR5                 0x20

//==============================================================================


//==============================================================================
//        COG1DBF Bits

extern __at(0x0696) __sfr COG1DBF;

typedef union
  {
  struct
    {
    unsigned G1DBF0             : 1;
    unsigned G1DBF1             : 1;
    unsigned G1DBF2             : 1;
    unsigned G1DBF3             : 1;
    unsigned G1DBF4             : 1;
    unsigned G1DBF5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G1DBF              : 6;
    unsigned                    : 2;
    };
  } __COG1DBFbits_t;

extern __at(0x0696) volatile __COG1DBFbits_t COG1DBFbits;

#define _G1DBF0                 0x01
#define _G1DBF1                 0x02
#define _G1DBF2                 0x04
#define _G1DBF3                 0x08
#define _G1DBF4                 0x10
#define _G1DBF5                 0x20

//==============================================================================


//==============================================================================
//        COG1CON0 Bits

extern __at(0x0697) __sfr COG1CON0;

typedef union
  {
  struct
    {
    unsigned G1MD0              : 1;
    unsigned G1MD1              : 1;
    unsigned G1MD2              : 1;
    unsigned G1CS0              : 1;
    unsigned G1CS1              : 1;
    unsigned                    : 1;
    unsigned G1LD               : 1;
    unsigned G1EN               : 1;
    };

  struct
    {
    unsigned G1MD               : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned                    : 3;
    unsigned G1CS               : 2;
    unsigned                    : 3;
    };
  } __COG1CON0bits_t;

extern __at(0x0697) volatile __COG1CON0bits_t COG1CON0bits;

#define _G1MD0                  0x01
#define _G1MD1                  0x02
#define _G1MD2                  0x04
#define _G1CS0                  0x08
#define _G1CS1                  0x10
#define _G1LD                   0x40
#define _G1EN                   0x80

//==============================================================================


//==============================================================================
//        COG1CON1 Bits

extern __at(0x0698) __sfr COG1CON1;

typedef struct
  {
  unsigned G1POLA               : 1;
  unsigned G1POLB               : 1;
  unsigned G1POLC               : 1;
  unsigned G1POLD               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned G1FDBS               : 1;
  unsigned G1RDBS               : 1;
  } __COG1CON1bits_t;

extern __at(0x0698) volatile __COG1CON1bits_t COG1CON1bits;

#define _G1POLA                 0x01
#define _G1POLB                 0x02
#define _G1POLC                 0x04
#define _G1POLD                 0x08
#define _G1FDBS                 0x40
#define _G1RDBS                 0x80

//==============================================================================


//==============================================================================
//        COG1RIS Bits

extern __at(0x0699) __sfr COG1RIS;

typedef union
  {
  struct
    {
    unsigned G1RIS0             : 1;
    unsigned G1RIS1             : 1;
    unsigned G1RIS2             : 1;
    unsigned G1RIS3             : 1;
    unsigned G1RIS4             : 1;
    unsigned G1RIS5             : 1;
    unsigned G1RIS6             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G1RIS              : 7;
    unsigned                    : 1;
    };
  } __COG1RISbits_t;

extern __at(0x0699) volatile __COG1RISbits_t COG1RISbits;

#define _G1RIS0                 0x01
#define _G1RIS1                 0x02
#define _G1RIS2                 0x04
#define _G1RIS3                 0x08
#define _G1RIS4                 0x10
#define _G1RIS5                 0x20
#define _G1RIS6                 0x40

//==============================================================================


//==============================================================================
//        COG1RSIM Bits

extern __at(0x069A) __sfr COG1RSIM;

typedef union
  {
  struct
    {
    unsigned G1RSIM0            : 1;
    unsigned G1RSIM1            : 1;
    unsigned G1RSIM2            : 1;
    unsigned G1RSIM3            : 1;
    unsigned G1RSIM4            : 1;
    unsigned G1RSIM5            : 1;
    unsigned G1RSIM6            : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G1RSIM             : 7;
    unsigned                    : 1;
    };
  } __COG1RSIMbits_t;

extern __at(0x069A) volatile __COG1RSIMbits_t COG1RSIMbits;

#define _G1RSIM0                0x01
#define _G1RSIM1                0x02
#define _G1RSIM2                0x04
#define _G1RSIM3                0x08
#define _G1RSIM4                0x10
#define _G1RSIM5                0x20
#define _G1RSIM6                0x40

//==============================================================================


//==============================================================================
//        COG1FIS Bits

extern __at(0x069B) __sfr COG1FIS;

typedef union
  {
  struct
    {
    unsigned G1FIS0             : 1;
    unsigned G1FIS1             : 1;
    unsigned G1FIS2             : 1;
    unsigned G1FIS3             : 1;
    unsigned G1FIS4             : 1;
    unsigned G1FIS5             : 1;
    unsigned G1FIS6             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G1FIS              : 7;
    unsigned                    : 1;
    };
  } __COG1FISbits_t;

extern __at(0x069B) volatile __COG1FISbits_t COG1FISbits;

